# Carga de datos a través de la función read_csv

In [3]:
# Librerias
import pandas as pd
import os

In [39]:
data = pd.read_csv(r'../datasets/titanic/titanic3.csv')

In [4]:
data.head(3)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [13]:
data2 = pd.read_csv(r'../datasets/customer-churn-model/Customer Churn Model.txt')
data2.head()

,State,Account Length,Area Code,Phone,Int'l Plan,VMail Plan,VMail Message,Day Mins,Day Calls,Day Charge,...,Eve Calls,Eve Charge,Night Mins,Night Calls,Night Charge,Intl Mins,Intl Calls,Intl Charge,CustServ Calls,Churn?
0,KS,128,415,382-4657,no,yes,25,265.1,110,45.07,...,99,16.78,244.7,91,11.01,10.0,3,2.70,1,False.
1,OH,107,415,371-7191,no,yes,26,161.6,123,27.47,...,103,16.62,254.4,103,11.45,13.7,3,3.70,1,False.
2,NJ,137,415,358-1921,no,no,0,243.4,114,41.38,...,110,10.30,162.6,104,7.32,12.2,5,3.29,0,False.
3,OH,84,408,375-9999,yes,no,0,299.4,71,50.90,...,88,5.26,196.9,89,8.86,6.6,7,1.78,2,False.
4,OK,75,415,330-6626,yes,no,0,166.7,113,28.34,...,122,12.61,186.9,121,8.41,10.1,3,2.73,3,False.

In [14]:
data2.columns.values

array(['State', 'Account Length', 'Area Code', 'Phone', "Int'l Plan",
       'VMail Plan', 'VMail Message', 'Day Mins', 'Day Calls',
       'Day Charge', 'Eve Mins', 'Eve Calls', 'Eve Charge', 'Night Mins',
       'Night Calls', 'Night Charge', 'Intl Mins', 'Intl Calls',
       'Intl Charge', 'CustServ Calls', 'Churn?'], dtype=object)

In [15]:
data_cols = pd.read_csv(r'../datasets/customer-churn-model/Customer Churn Columns.csv')

In [16]:
data_cols_list = data_cols['Column_Names'].tolist()
data_cols_list

['A',
 'B',
 'C',
 'D',
 'E',
 'F',
 'G',
 'H',
 'I',
 'J',
 'K',
 'L',
 'M',
 'N',
 'O',
 'P',
 'Q',
 'R',
 'S',
 'T',
 'U']

In [17]:
data2 = pd.read_csv(r'../datasets/customer-churn-model/Customer Churn Model.txt', header=None, names = data_cols_list)
data2.head()

,A,B,C,D,E,F,G,H,I,J,...,L,M,N,O,P,Q,R,S,T,U
0,State,Account Length,Area Code,Phone,Int'l Plan,VMail Plan,VMail Message,Day Mins,Day Calls,Day Charge,...,Eve Calls,Eve Charge,Night Mins,Night Calls,Night Charge,Intl Mins,Intl Calls,Intl Charge,CustServ Calls,Churn?
1,KS,128,415,382-4657,no,yes,25,265.100000,110,45.070000,...,99,16.780000,244.700000,91,11.010000,10.000000,3,2.700000,1,False.
2,OH,107,415,371-7191,no,yes,26,161.600000,123,27.470000,...,103,16.620000,254.400000,103,11.450000,13.700000,3,3.700000,1,False.
3,NJ,137,415,358-1921,no,no,0,243.400000,114,41.380000,...,110,10.300000,162.600000,104,7.320000,12.200000,5,3.290000,0,False.
4,OH,84,408,375-9999,yes,no,0,299.400000,71,50.900000,...,88,5.260000,196.900000,89,8.860000,6.600000,7,1.780000,2,False.

# Carga de datos a través de la función **open**

In [36]:
# 'r' modo lectura
data3 = open(r'../datasets/customer-churn-model/Customer Churn Model.txt','r')

In [37]:
cols = data3.readline().strip().split(',')
n_cols = len(cols)
cols

['State',
 'Account Length',
 'Area Code',
 'Phone',
 "Int'l Plan",
 'VMail Plan',
 'VMail Message',
 'Day Mins',
 'Day Calls',
 'Day Charge',
 'Eve Mins',
 'Eve Calls',
 'Eve Charge',
 'Night Mins',
 'Night Calls',
 'Night Charge',
 'Intl Mins',
 'Intl Calls',
 'Intl Charge',
 'CustServ Calls',
 'Churn?']

In [27]:
counter = 0
main_dict = {}
for col in cols:
    main_dict[col] = []

In [28]:
main_dict

{'OH': [],
 '84': [],
 '408': [],
 '375-9999': [],
 'yes': [],
 'no': [],
 '0': [],
 '299.400000': [],
 '71': [],
 '50.900000': [],
 '61.900000': [],
 '88': [],
 '5.260000': [],
 '196.900000': [],
 '89': [],
 '8.860000': [],
 '6.600000': [],
 '7': [],
 '1.780000': [],
 '2': [],
 'False.': []}

In [34]:
for line in data3:
    values = line.strip().split(',')
    for i in range(len(cols)):
        main_dict[cols[i]].append(values[i])
    counter += 1
print('El dataset tiene %d filas y %d columnas' % (counter, n_cols))

El dataset tiene 3327 filas y 21 columnas

In [35]:
df3 = pd.DataFrame(main_dict)
df3.head()

,OH,84,408,375-9999,yes,no,0,299.400000,71,50.900000,...,88,5.260000,196.900000,89,8.860000,6.600000,7,1.780000,2,False.
0,MA,121,510,355-9993,no,yes,24,218.200000,88,37.090000,...,108,29.620000,212.600000,118,9.570000,7.500000,7,2.030000,3,False.
1,MO,147,415,329-9001,yes,no,0,157.000000,79,26.690000,...,94,8.760000,211.800000,96,9.530000,7.100000,6,1.920000,0,False.
2,LA,117,408,335-4719,no,no,0,184.500000,97,31.370000,...,80,29.890000,215.800000,90,9.710000,8.700000,4,2.350000,1,False.
3,WV,141,415,330-8173,yes,yes,37,258.600000,84,43.960000,...,111,18.870000,326.400000,97,14.690000,11.200000,5,3.020000,0,False.
4,IN,65,415,329-6603,no,no,0,129.100000,137,21.950000,...,83,19.420000,208.800000,111,9.400000,12.700000,6,3.430000,4,True.

In [42]:
mainpath = r'/Users/lgutierrez/Documents/Desarrollo/python-ml-course/datasets'
filename = r'/titanic/titanic3.csv'
fullpath = mainpath+filename
data = pd.read_csv(fullpath)
data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

# Lectura y escritura de ficheros

In [55]:
mainpath = r'/Users/lgutierrez/Documents/Desarrollo/python-ml-course/datasets/'
datapath = r'customer-churn-model/'
filename = r'Customer Churn Model.txt'

infile  = mainpath+datapath+filename
outfile = mainpath+datapath+'Outfile-'+filename

In [59]:
with open(infile, 'r') as infile1:
    with open(outfile, 'w') as outfile1:
        for line in infile1:
            fields = line.strip().split(',')
            outfile1.write('\t'.join(fields))
            outfile1.write('\n')

In [61]:
df4 = pd.read_csv(outfile, sep = '\t')
df4

,State,Account Length,Area Code,Phone,Int'l Plan,VMail Plan,VMail Message,Day Mins,Day Calls,Day Charge,...,Eve Calls,Eve Charge,Night Mins,Night Calls,Night Charge,Intl Mins,Intl Calls,Intl Charge,CustServ Calls,Churn?
0,KS,128,415,382-4657,no,yes,25,265.1,110,45.07,...,99,16.78,244.7,91,11.01,10.0,3,2.70,1,False.
1,OH,107,415,371-7191,no,yes,26,161.6,123,27.47,...,103,16.62,254.4,103,11.45,13.7,3,3.70,1,False.
2,NJ,137,415,358-1921,no,no,0,243.4,114,41.38,...,110,10.30,162.6,104,7.32,12.2,5,3.29,0,False.
3,OH,84,408,375-9999,yes,no,0,299.4,71,50.90,...,88,5.26,196.9,89,8.86,6.6,7,1.78,2,False.
4,OK,75,415,330-6626,yes,no,0,166.7,113,28.34,...,122,12.61,186.9,121,8.41,10.1,3,2.73,3,False.
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3328,AZ,192,415,414-4276,no,yes,36,156.2,77,26.55,...,126,18.32,279.1,83,12.56,9.9,6,2.67,2,False.
3329,WV,68,415,370-3271,no,no,0,231.1,57,39.29,...,55,13.04,191.3,123,8.61,9.6,4,2.59,3,False.
3330,RI,28,510,328-8230,no,no,0,180.8,109,30.74,...,58,24.55,191.9,91,8.64,14.1,6,3.81,2,False.
3331,CT,184,510,364-6381,yes,no,0,213.8,105,36.35,...,84,13.57,139.2,137,6.26,5.0,10,1.35,2,False.
3332,TN,74,415,400-4344,no,yes,25,234.4,113,39.85,...,82,22.60,241.4,77,10.86,13.7,4,3.70,0,False.

In [4]:
medals_url = "http://winterolympicsmedals.com/medals.csv"
medals_data = pd.read_csv(medals_url)
medals_data.head()

,Year,City,Sport,Discipline,NOC,Event,Event gender,Medal
0,1924,Chamonix,Skating,Figure skating,AUT,individual,M,Silver
1,1924,Chamonix,Skating,Figure skating,AUT,individual,W,Gold
2,1924,Chamonix,Skating,Figure skating,AUT,pairs,X,Gold
3,1924,Chamonix,Bobsleigh,Bobsleigh,BEL,four-man,M,Bronze
4,1924,Chamonix,Ice Hockey,Ice Hockey,CAN,ice hockey,M,Gold

## Ejercicio para descarga de datos con la libreria URLLIB3

In [5]:
import urllib3
http = urllib3.PoolManager()
r = http.request('GET', medals_url)
r.status
response = r.data

In [23]:
import csv
cr = csv.reader(response)

In [24]:
print(cr)

<_csv.reader object at 0x000001E79C0E7040>

## decondificar el string binario

In [30]:
str_data = response.decode('utf-8')

In [32]:
# divimos el string en un array de filas separad por enters
lines = str_data.split('\n')

In [33]:
# La primer línea contiene la cabecera
col_names = lines[0].split(',')
n_cols = len(col_names)

In [34]:
# Generamos un diccionario vacio donde irá la información procesada desde la URL
counter = 0
main_dict = {}
for col in col_names:
    main_dict[col] = []

In [37]:
# Procesamos fila a fila la información para ir rrellenando el diccionario
for line in lines:
    # nos saltamos la primer fila que contine la cabecera
    if(counter>0):
        # dividimos cada string por las comas 
        values = line.strip().split(',')
        # añadimos los valores en su respectiva columna
        for i in range(len(col_names)):
            main_dict[col_names[i]].append(values[i])
    counter += 1
print(f'La data tiene {counter} filas y {n_cols} columnas.')

La data tiene 6936 filas y 8 columnas.

In [38]:
# convertimos el diccionario en un dataframe 
medals_df = pd.DataFrame(main_dict)
medals_df.head()

,Year,City,Sport,Discipline,NOC,Event,Event gender,Medal
0,1924,Chamonix,Skating,Figure skating,AUT,individual,M,Silver
1,1924,Chamonix,Skating,Figure skating,AUT,individual,W,Gold
2,1924,Chamonix,Skating,Figure skating,AUT,pairs,X,Gold
3,1924,Chamonix,Bobsleigh,Bobsleigh,BEL,four-man,M,Bronze
4,1924,Chamonix,Ice Hockey,Ice Hockey,CAN,ice hockey,M,Gold

In [44]:
# Guardamos el archivo en nuestra pc
datapath = 'athletes/'
filename = 'medals2'
fullpath = os.path.join(mainpath+datapath, filename)
medals_df.to_csv(fullpath+'.csv')
medals_df.to_json(fullpath+'.json')
medals_df.to_excel(fullpath+'.xls')

<ipython-input-44-abea54c07c8f>:7: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  medals_df.to_excel(fullpath+'.xls')

# Ficheros XLS y XLSX

In [20]:
mainpath = '/Users/lgutierrez/Documents/Desarrollo/python-ml-course/datasets/'
datapath = 'titanic/'
filename = 'titanic3.xlsx'

titanic2 = pd.read_excel(mainpath+datapath+filename, 'titanic3')
titanic2.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [21]:
titanic2.to_csv(mainpath+datapath+'titanic_mio.csv')